W7D2/to_do/app/controllers/api/todos_controller.rb

  def create
    @todo = Todo.new(todo_params)
    if @todo.save
---
INSERT INTO "todos" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Clean the house"], ["body", "Everywhere!!"], ["created_at", "2018-01-23 22:06:31.803178"], ["updated_at", "2018-01-23 22:06:31.803178"]]

  def update
    @todo = Todo.find_by(id: params[:id])
    if @todo
      if @todo.update(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "done" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["done", "t"], ["updated_at", "2018-01-23 23:31:38.405357"], ["id", 1]]

  def destroy
    @todo = Todo.find_by(id: params[:id])
    if @todo
      @todo.destroy
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 6]]