W5D1/goal_app/app/views/cheers/index.html.erb

SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 1]]
SELECT "cheers".* FROM "cheers" WHERE "cheers"."goal_id" = $1  [["goal_id", 1]]
---
  <tbody>
    <% current_user.goals.each do |goal| %>
      <% goal.cheers.each do |cheer| %>