W7D3/pokedex/app/views/api/pokemon/show.json.jbuilder

  json.set! :image_url, asset_path(@pokemon.image_url)
  json.set! :item_ids, @pokemon.items.pluck(:id)
---
SELECT "items"."id" FROM "items" WHERE "items"."pokemon_id" = $1  [["pokemon_id", 5]]

json.set! :items do
  @pokemon.items.each {|item|
---
SELECT "items".* FROM "items" WHERE "items"."pokemon_id" = $1  [["pokemon_id", 5]]