W4D2/ninetynine_cats/app/views/cats/show.html.erb

SELECT  1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 LIMIT $2  [["cat_id", 1], ["LIMIT", 1]]
---

<% if !@cat.cat_rental_requests.empty? %>

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY "cat_rental_requests"."start_date" ASC  [["cat_id", 1]]
---
    <ol>
    <% @cat.cat_rental_requests.order(:start_date).each do |request| %>