W4D2/ninetynine_cats/app/controllers/cat_rental_requests_controller.rb

  def new
    @cats_name = Cat.select(:name, :id)
---
SELECT "cats"."name", "cats"."id" FROM "cats"

  def create
    @request = CatRentalRequest.new(request_params)
    if @request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "created_at", "updated_at", "start_date", "end_date") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 1], ["created_at", "2018-01-03 04:12:10.993086"], ["updated_at", "2018-01-03 04:12:10.993086"], ["start_date", "2018-01-02"], ["end_date", "2018-01-06"]]