W4D2/ninetynine_cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("color", "birth_date", "sex", "description", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @cat = Cat.new(cat_params)
    if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 3]]
---
  def destroy
    @cat = Cat.find_by(id: params[:id])
    if @cat
      @cat.destroy