W5D1/goal_app/app/controllers/cheers_controller.rb

INSERT INTO "cheers" ("user_id", "goal_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["goal_id", 1], ["created_at", "2018-01-09 20:15:22.423514"], ["updated_at", "2018-01-09 20:15:22.423514"]]
---
  def create
    @cheer = Cheer.new
    @cheer.user_id = current_user.id
    @cheer.goal_id = params[:goal_id]
    if @cheer.save

SELECT "cheers".* FROM "cheers" WHERE "cheers"."goal_id" = $1  [["goal_id", 1]]
---
    def set_cheer
      @cheer = Cheer.find(params[:id])