W5D1/goal_app/app/controllers/comments_controller.rb

  def index
    if params[:user_id]
      @comments = User.find_by(id: params[:user_id]).comments
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]

  def create
    @comment = Comment.new(comment_params)
    if params[:user_id]
      @comment.commentable_id = params[:user_id]
      @comment.commentable_type = 'User'
    end
    if params[:goal_id]
      @comment.commentable_id = params[:goal_id]
      @comment.commentable_type = 'Goal'
    end
    if @comment.save
---
INSERT INTO "comments" ("body", "created_at", "updated_at", "commentable_type", "commentable_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "1st comment for lu"], ["created_at", "2018-01-09 17:48:58.461948"], ["updated_at", "2018-01-09 17:48:58.461948"], ["commentable_type", "User"], ["commentable_id", 1]]