W5D1/goal_app/app/controllers/goals_controller.rb

  def index
    @user = User.find_by(id: params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @goal = Goal.new(goal_params)
    @goal.user_id = current_user.id
    # debugger
    if @goal.save
---
INSERT INTO "goals" ("title", "details", "private", "completed", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "2018"], ["details", "2018 Jan"], ["private", "0"], ["completed", "0"], ["user_id", 1], ["created_at", "2018-01-09 07:56:16.672531"], ["updated_at", "2018-01-09 07:56:16.672531"]]

  def complete
    @goal.completed = "1"
    @goal.save
---
UPDATE "goals" SET "completed" = $1, "updated_at" = $2 WHERE "goals"."id" = $3  [["completed", "1"], ["updated_at", "2018-01-09 08:16:32.974372"], ["id", 2]]

  def uncomplete
    @goal.completed = "0"
    @goal.save
---
UPDATE "goals" SET "completed" = $1, "updated_at" = $2 WHERE "goals"."id" = $3  [["completed", "0"], ["updated_at", "2018-01-09 08:17:38.274467"], ["id", 2]]

  def destroy
      @goal.destroy
---
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 1]]

    def set_goal
      @goal = Goal.find(params[:id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]