W5D1/goal_app/app/views/goals/_index.html.erb

    <ul>
      <% @user.goals.each do |goal| %>
---
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 1]]

            <br>
            <% if current_user.id != goal.user_id && !current_user.cheers.pluck(:goal_id).include?(goal.id) && current_user.cheers.length < 12 %>
---
SELECT "cheers"."goal_id" FROM "cheers" WHERE "cheers"."user_id" = $1  [["user_id", 1]]