W5D1/goal_app/app/views/goals/index.html.erb

    <ul>
      <% @user.goals.each do |goal| %>
---
SELECT  "goals".* FROM "goals" WHERE "goals"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]