W5D1/goal_app/app/views/goals/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."goal_id" = $1  [["goal_id", 1]]
---
  <ul>
    <% @goal.comments.each do |comment| %>