W5D1/goal_app/app/views/comments/_index.html.erb

  <ul>
    <% @user.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]